---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMax
source: html/9b785b5c-cb11-518e-ed5f-6c60add89acd.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveWaveLenMax Property

The property labeled "Len Max" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveWaveLenMax { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".